# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai .
# Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1

n = int(input("Введите кол-во элементов в списке: "))
print(list(range(n)))
k = int(input("Введите элемент, который хотите проверить: "))
print("Проверяем", k)
count = 0
for i in list(range(n)):
    if i == k:
        count += 1
        print("Вхождений ->", count)
